Repository: tangem/tangem-sdk-ios
Catalog: TangemSdk/TangemSdk/Common/Localization/*.lproj/Localizable.strings
Languages: fr, ru, zh_hant

# nfc_session_timeout
source: Session timeout. Please, try again.
fr: Dépassement de temps imparti de la séance. Essayez encore une fois
ru: Время сессии истекло. Пожалуйста, попробуйте еще раз.
zh_hant: 會話超時。請再試一遍

# nfc_alert_sign_completed
source: Transaction has been successfully signed
fr: Transaction a été signée avec succès

# view_delegate_security_delay
source: Long tap
fr: Tenez la carte fermement

# nfc_seconds_left
source: %@ left
fr: Il reste %@

# nfc_alert_default_done
source: Done
fr: Exécuté
ru: Готово
zh_hant: 完畢

# nfc_stuck_error
source: It seems that NFC does not work properly on your iPhone
fr: Il semble que NFC ne fonctionne pas correctement sur votre iPhone
ru: Судя по всему, NFC не работает должным образом на вашем iPhone
zh_hant: NFC 似乎無法在您的 iPhone 上正常工作

# unknownStatus
source: Unknown card status
fr: Status inconnu de la carte

# generic_error_code
source: An error occurred during the operation. Code: %@.
fr: Une erreur s'est produite lors de l'opération. Code : %@.
ru: Во время операции произошла ошибка. Код: %@.
zh_hant: 操作過程中發生錯誤。代碼: %@

# reading_data_progress
source: Reading data: %@%%
fr: Lecture des données : %@%%

# writing_data_progress
source: Writing data: %@%%
fr: Enregistrement de données : %@%%

# pin1
source: Access code
fr: Code d’accès
ru: Код доступа
zh_hant: 訪問密碼

# pin2
source: Passcode
fr: Mot de passe
ru: Пароль
zh_hant: 密碼

# pin_enter
source: Enter %@
fr: Saisir %@
ru: Введите %@
zh_hant: 輸入 %@

# pin_confirm_error_format
source: Codes do not match
fr: Codes ne correspondent pas
ru: Коды не совпадают
zh_hant: 密碼不相符

# pin_change_code_format
source: Set %@
fr: Modifier %@
ru: Установить %@

# pin_change_new_code_format
source: New %@
fr: Nouveau %@
ru: Новый %@
zh_hant: 新 %@

# pin_change_current_code_format
source: Current %@
fr: Actuel %@

# pin_set_code_confirm_format
source: Confirm %@
fr: Confirmer %@
ru: Подтвердить %@
zh_hant: 確認 %@

# common_cancel
source: Cancel
fr: Annuler
ru: Отменить
zh_hant: 取消

# common_continue
source: Continue
fr: Continuer
ru: Продолжить
zh_hant: 繼續

# common_save
source: Save
fr: Sauvegarder

# common_success
source: Success
fr: Avec succès
ru: Успешно
zh_hant: 成功

# common_error
source: Error
fr: Erreur
ru: Ошибка
zh_hant: 錯誤

# error_operation
source: An error occurred during the operation
fr: Une erreur s'est produite lors de l'opération

# error_tag_lost
source: Tag lost.
fr: Tag est perdu

# error_already_personalized
source: This card has already been personalized
fr: Cette carte a déjà été personnalisée

# error_cannot_be_depersonalized
source: This card cannot be depersonalized
fr: Cette carte ne peut pas être dépersonnalisée.

# error_already_created
source: A wallet has already been created
fr: Le portefeuille a déjà été créé
ru: Кошелек уже создан
zh_hant: 已創建錢包

# error_purge_prohibited
source: This card’s configuration does not allow you to erase the wallet
fr: La configuration de cette carte ne permet pas d'effacer le portefeuille
ru: Конфигурация этой карты не позволяет удалить кошелек
zh_hant: 此卡的配置不允許您清除錢包

# error_pin1_cannot_be_changed
source: Access Code cannot be changed
fr: Le code d'accès ne peut pas être modifié

# error_pin2_cannot_be_changed
source: Passcode cannot be changed
fr: Le mot de passe ne peut pas être modifié

# error_pin1_cannot_be_default
source: Access Code cannot be changed to the default value. Please create a new Access Code.
fr: Le code d'accès ne peut pas être remplacé par la valeur par défaut. Créer un nouveau code d'accès

# error_no_remaining_signatures
source: You cannot sign data with this wallet because the card has reached its signature limit
fr: Vous ne pouvez pas signer les données avec ce portefeuille car la carte a atteint sa limite de signatures

# error_empty_hashes
source: There is nothing to sign here
fr: Il n'y a rien à signer ici

# error_cannot_be_signed
source: This data cannot be signed
fr: Ces données ne peuvent pas être signées

# error_not_personalized
source: This card has not been personalized
fr: Cette carte n'a pas été personnalisée

# error_not_activated
source: This card has not been activated
fr: Cette carte n'a pas été activée
ru: Эта карта не активирована
zh_hant: 此卡尚未激活

# error_verification_failed
source: Data verification failed
fr: Erreur de validation des données

# error_card_verification_failed
source: Card verification failed
fr: Erreur de validation de la carte
ru: Ошибка проверки карты
zh_hant: 卡驗證失敗

# error_data_size_too_large
source: Data size exceeds the max limit of 512 bytes
fr: La taille des données dépasse la limite maximale de 512 bytes

# error_data_size_too_large_extended
source: Data size exceeds the max limit of 32 Kbytes
fr: La taille des données dépasse la limite maximale de 32 kilo-bytes

# error_missing_counter
source: The data cannot be written to the card because there is no counter
fr: Les données ne peuvent pas être écrites sur la carte car il n'y a pas de compteur

# error_data_cannot_be_written
source: The data cannot be written to the card
fr: Les données ne peuvent pas être écrites sur la carte

# error_missing_issuer_public_key
source: The issuer public key is missing
fr: La clé publique de l'émetteur est manquante

# error_user_cancelled
source: The user cancelled the operation
fr: L'utilisateur a annulé l'opération
ru: Пользователь отменил операцию
zh_hant: 用戶取消了操作

# error_busy
source: The CardSession is running a command. Please wait and try again
fr: La commande est exécutée dans l'élément CardSession. Veuillez attendre et réessayer

# error_wrong_card_number
source: You tapped a different card. Please match the in-app Card ID to the your physical Card ID to continue this process.
fr: Vous avez connecté la mauvaise carte. Pour poursuivre ce processus, l'identificateur de la carte dans l'application doit correspondre à votre identificateur physique de la carte.

# error_wrong_card_type
source: This card is not designed to work with this app.
fr: Cette carte est personnalisée pour une autre application. Veuillez lire les informations sur votre carte et télécharger l'application correspondante.
ru: Данная карта не предназначена для работы с этим приложением
zh_hant: 此卡不適用於此應用

# error_card_error
source: Your card is missing essential data
fr: Des données importantes manquent sur votre carte

# error_pin1_required
source: Access code is required
fr: Code d'accès est requis

# error_pin2_required
source: Passcode is required
fr: Mot de passe est requis

# error_wrong_card
source: Wrong Card
fr: Mauvaise carte

# error_invalid_response
source: Invalid Response
fr: Réponse incorrecte

# dialog_nfc_enable_title
source: Enable NFC?
fr: Activer NFC?

# dialog_nfc_enable_text
source: This app needs NFC to be switched on. Hit OK to go to Settings, where you can enable NFC.
fr: NFC doit être activé pour que cette application fonctionne. Cliquez sur le bouton OK pour accéder aux Paramètres où vous pouvez activer NFC

# view_delegate_security_delay_description
source: Hold the card firmly until the operation is finished
fr: Maintenez la carte jusqu'à ce que l'opération soit terminée
ru: Пожалуйста, удерживайте карту до завершения операции
zh_hant: 為確保安全，請持有卡直至操作完成

# view_delegate_delay
source: Operation is in progress
fr: Opération est en cours

# view_delegate_delay_description
source: Please hold the card firmly until the operation is completed
fr: Tenez fermement la carte jusqu'à ce que l'opération soit terminée

# view_delegate_scan
source: Ready to scan
fr: Prêt pour scanner

# view_delegate_scan_description
source: Scan card with your phone as shown above
fr: Scannez la carte avec votre téléphone comme indiqué ci-dessus
zh_hant: 如上圖觸碰卡片並按住直到操作結束

# view_delegate_header_card
source: Card
fr: Carte

# view_delegate_header_any_card
source: Any card
fr: Toute carte

# how_to_unknown_tap_card
source: Tap your card to the back of the phone
fr: Appuyez votre carte au dos de votre téléphone

# how_to_unknown_move_card
source: To detect where your NFC antenna is located, move the card up and down until confirmation.
fr: Pour déterminer où se trouve votre antenne NFC, déplacez la carte de haut en bas jusqu'à ce que la confirmation soit reçue

# how_to_unknown_nothing_happened
source: Nothing happened? Try removing your card from the phone and then put it back.
fr: Aucun résultat? Essayez de retirer la carte de votre téléphone, puis de la reappuyer

# how_to_unknown_detected
source: Connection was established.. This is the placement of your NFC antenna
fr: La connexion a été établie. Votre antenne NFC se trouve ici

# how_to_nfc_detected
source: You just found the location of your NFC antenna. Please remember it.
fr: Vous venez de trouver l’emplacement de votre antenne NFC. Veuillez le mémoriser

# how_to_known_here_how_to_use
source: Here's how to use Tangem Cards with (phone)
fr: Ici est expliqué comment utiliser les cartes Tangem avec (le téléphone)

# how_to_known_antenna_is_here
source: Your NFC antenna is here
fr: Votre antenne NFC est ici

# how_to_known_tap_card_to_the_back
source: Tap your card to the back of the phone
fr: Posez votre carte sur le dos du téléphone

# how_to_known_tap_card_to_the_front
source: Tap your card to the front of the phone
fr: Posez votre carte sur l’écran du téléphone

# how_to_button
source: How to
fr: Consigne

# how_to_got_it_button
source: Ok, got it!
fr: OK, j’ai compris !

# how_to_try_other_way_button
source: Still not working
fr: Ceci ne fonctionne toujours pas

# how_to_show_again_button
source: Show again
fr: Montrer encore une fois

# tap_in_button
source: Tap in
fr: Connecter

# tap_in_known_info_message
source: Hold your card to the phone as demonstrated when you tap in to connect.
fr: Tenez fermement la carte près du téléphone comme indiqué sur l'image lorsque vous l'utilisez pour vous connecter

# tap_in_known_show_how_tap_in_button
source: Show me how to tap in
fr: Montrez-moi comment me connecter

# tap_in_unknown_info_message
source: Watch the video to see how to tap in and connect the NFC in your phone to the card.
fr: Regardez la vidéo pour découvrir comment accéder et connecter le NFC de votre téléphone à la carte

# tap_in_unknown_how_to_tap_in_button
source: How to tap in
fr: Comment vous connecter

# pin_change_new_code_confirm_format
source: New %@ (Confirm)
fr: Nouveau %@ (Confirmer)

# pin_set_code_format
source: Set %@
fr: Saisir %@
zh_hant: 設置 %@

# error_backup_wrong_card
source: This card can’t be used as a backup card. Code: %@.
fr: This card can’t be used as a backup card. Error code: %@.
ru: Эту карту нельзя использовать для резервного копирования. Код ошибки: %@.
zh_hant: 此卡不能作為備用卡使用。錯誤代碼：%@。

# nfc_alert_default
source: Connect your phone and the card exactly as it shown above
ru: Поднесите карту к телефону в точности, как показано выше

# cid_format
source: Card #%@
ru: Карта #%@
zh_hant: 卡片 ＃%@

# common_ok
source: OK
ru: Ок

# common_warning
source: Warning
ru: Предупреждение
zh_hant: 警告

# common_retry
source: Retry
ru: Повторить
zh_hant: 重試

# common_understand
source: I understand
ru: Я понимаю
zh_hant: 我明白

# enter_user_code_button_title_forgot
source: Forgot your code?
ru: Забыли код?

# pin_reset_code_format
source: Reset %@
ru: Сбросить %@
zh_hant: 重置 %@

# error_file_not_found
source: File not found
ru: Файл не найден
zh_hant: 文件未找到

# error_not_supported_firmware_version
source: Card firmware does not meet requirements
ru: Эта команда не поддерживается данной картой

# error_old_card
source: Tangem cards issued before September 2019 cannot sign data using an iPhone due to iOS restrictions
ru: Карты Tangem, выпущенные до сентября 2019 года, не могут подписывать данные с помощью iPhone из-за ограничений iOS.
zh_hant: 由於 iOS 限制，2019 年 9 月之前發行的 Tangem 卡無法使用 iPhone 簽署數據

# error_backup_card_already_added
source: This card has already been added to the list.
ru: Эта карта уже добавлена в список
zh_hant: 此卡已添加到列表中

# backup_prepare_primary_card_message
source: Connect your phone and the primary card exactly as it shown above.
ru: Соедините телефон и основную карту в точности, как показано выше.
zh_hant: 完全按照上圖所示連接手機和主卡

# backup_prepare_primary_card_message_format
source: Connect your phone and the primary card with number %@ exactly as it shown above.
ru: Соедините телефон и основную карту с номером %@ в точности, как показано выше.
zh_hant: 完全按照上面顯示的方式連接您的手機和編號為 %@ 的主卡

# backup_add_backup_card_message
source: Connect your phone and the card you want to use as a backup exactly as it shown above.
ru: Соедините телефон и карту, которую вы хотите использовать в качестве резервной, в точности, как показано выше.
zh_hant: 完全按照上圖所示連接手機和要用作備份的卡

# backup_finalize_primary_card_message_format
source: Connect your phone and the primary card with number %@ exactly as it shown above.
ru: Соедините телефон и основную карту с номером %@ в точности, как показано выше.
zh_hant: 完全按照上面顯示的方式連接您的手機和編號為 %@ 的主卡

# backup_finalize_backup_card_message_format
source: Connect your phone and the backup card with number %@ exactly as it shown above.
ru: Соедините телефон и резервную карту с номером %@ в точности, как показано выше.
zh_hant: 完全按照上面顯示的方式連接您的手機和編號為 %@ 的備用卡

# issuer_signature_loading_failed
source: Couldn't load the card's certificate from the server. Please, try again later.
ru: Не удалось загрузить сертификат карты. Пожалуйста, повторите попытку позже.
zh_hant: 無法從服務器加載卡的認證。稍後再試

# attestation_failed_dev_card
source: This is a development card. You can continue at your own risk
ru: Это карта предназначена для тестовых целей. Её подлинность не может быть проверена. Не принимайте эту карту как средство оплаты.
zh_hant: 這是一張開發卡。其真實性無從考證。不接受此卡作為付款方式。

# attestation_failed_card
source: This card may be production sample or conterfeit. You can continue at your own risk
ru: Эта карта – серийный образец или подделка. Вы можете продолжать на свой страх и риск
zh_hant: 此卡可能是生產樣本或偽造品。您繼續操作的話請自擔風險

# attestation_online_failed_title
source: Online attestation failed
ru: Онлайн-аттестация не удалась
zh_hant: 在線認證失敗

# attestation_online_failed_body
source: We cannot finish card's online attestation at this time. You can continue at your own risk and try again later, retry now or cancel the operation
ru: В настоящее время мы не можем завершить онлайн-аттестацию карты. Вы можете продолжить на свой страх и риск и повторить попытку позже, повторить сейчас или отменить операцию.
zh_hant: 目前無法完成卡的在線認證。您可以自行承擔風險並稍後重試、立即重試或取消操作

# attestation_warning_attest_wallets
source: Too large runs count of Attest Wallet or Sign looks suspicious.
ru: Слишком большое количество вызовов Attest Wallet или Sign выглядит подозрительно.
zh_hant: 運行太多的 Attest Wallet 或 Sign 看起來很可疑。

# reset_codes_message_title_restore
source: Tap the card you want to restore
ru: Отсканируйте карту, которую хотите восстановить
zh_hant: 點按要恢復的卡片

# reset_codes_message_body_restore
source: First, prepare the card for restore process.
ru: Сначала подготовьте карту к процессу восстановления
zh_hant: 首先，為恢復過程準備卡片

# reset_codes_message_title_backup
source: Tap a backup card
ru: Приложите резервную карту
zh_hant: 掃描備用卡片

# reset_codes_message_body_backup
source: Tap the linked card.
ru: Приложите связанную карту
zh_hant: 掃描連接的卡片

# reset_codes_message_body_restore_final
source: Tap the restore card again.
ru: Приложите еще раз карту, которую хотите восстановить
zh_hant: 再次掃描恢復卡片

# reset_codes_success_message
source: Code was reset successfully
ru: Код успешно сброшен
zh_hant: 密碼重置成功
